RevolutionLighting/RPDG_Hardware/SRC/SmartStrip/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U,        /* Input direction */
    kPIN_MUX_DirectionOutput = 1U,       /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief UART 0 Receive Data Source Select: UART0_RX pin */
#define SOPT5_UART0RXSRC_UART_RX 0x00u
/*!
 * @brief UART 0 Transmit Data Source Select: UART0_TX pin */
#define SOPT5_UART0TXSRC_UART_TX 0x00u
/*!
 * @brief FTM0 channel 0 output PWM/OCMP mode source select: FTM0CH0 pin is the output of FTM0 channel 0 PWM/OCMP */
#define SOPT8_FTM0OCH0SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 1 output PWM/OCMP mode source select: FTM0CH1 pin is the output of FTM0 channel 1 PWM/OCMP */
#define SOPT8_FTM0OCH1SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 2 output PWM/OCMP mode source select: FTM0CH2 pin is the output of FTM0 channel 2 PWM/OCMP */
#define SOPT8_FTM0OCH2SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 3 output PWM/OCMP mode source select: FTM0CH3 pin is the output of FTM0 channel 3 PWM/OCMP */
#define SOPT8_FTM0OCH3SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 4 output PWM/OCMP mode source select: FTM0CH4 pin is the output of FTM0 channel 4 PWM/OCMP */
#define SOPT8_FTM0OCH4SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 5 output PWM/OCMP mode source select: FTM0CH5 pin is the output of FTM0 channel 5 PWM/OCMP */
#define SOPT8_FTM0OCH5SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM2 channel 0 output PWM/OCMP mode source select: FTM2CH0 pin is the output of FTM2 channel 0 PWM/OCMP */
#define SOPT8_FTM2OCH0SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM2 channel 1 output PWM/OCMP mode source select: FTM2CH1 pin is the output of FTM2 channel 1 PWM/OCMP */
#define SOPT8_FTM2OCH1SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM4 channel 0 output PWM/OCMP mode source select: FTM4CH0 pin is the output of FTM4 channel 0 PWM/OCMP */
#define SOPT9_FTM4OCH0SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM4 channel 1 output PWM/OCMP mode source select: FTM4CH1 pin is the output of FTM4 channel 1 PWM/OCMP */
#define SOPT9_FTM4OCH1SRC_NO_MODULATION 0x00u

/*! @name PORTE16 (number 3), TP2
  @{ */
#define BOARD_INITPINS_TP2_PERIPHERAL GPIOE /*!<@brief Device name: GPIOE */
#define BOARD_INITPINS_TP2_SIGNAL GPIO      /*!<@brief GPIOE signal: GPIO */
#define BOARD_INITPINS_TP2_GPIO GPIOE       /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITPINS_TP2_GPIO_PIN 16U     /*!<@brief PORTE pin index: 16 */
#define BOARD_INITPINS_TP2_PORT PORTE       /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_TP2_PIN 16U          /*!<@brief PORTE pin index: 16 */
#define BOARD_INITPINS_TP2_CHANNEL 16       /*!<@brief GPIOE GPIO channel: 16 */
#define BOARD_INITPINS_TP2_PIN_NAME PTE16   /*!<@brief Pin name */
#define BOARD_INITPINS_TP2_LABEL "TP2"      /*!<@brief Label */
#define BOARD_INITPINS_TP2_NAME "TP2"       /*!<@brief Identifier name */
                                            /* @} */

/*! @name PORTE17 (number 4), TP3
  @{ */
#define BOARD_INITPINS_TP3_PERIPHERAL GPIOE /*!<@brief Device name: GPIOE */
#define BOARD_INITPINS_TP3_SIGNAL GPIO      /*!<@brief GPIOE signal: GPIO */
#define BOARD_INITPINS_TP3_GPIO GPIOE       /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITPINS_TP3_GPIO_PIN 17U     /*!<@brief PORTE pin index: 17 */
#define BOARD_INITPINS_TP3_PORT PORTE       /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_TP3_PIN 17U          /*!<@brief PORTE pin index: 17 */
#define BOARD_INITPINS_TP3_CHANNEL 17       /*!<@brief GPIOE GPIO channel: 17 */
#define BOARD_INITPINS_TP3_PIN_NAME PTE17   /*!<@brief Pin name */
#define BOARD_INITPINS_TP3_LABEL "TP3"      /*!<@brief Label */
#define BOARD_INITPINS_TP3_NAME "TP3"       /*!<@brief Identifier name */
                                            /* @} */

/*! @name PORTE18 (number 5), SDA
  @{ */
#define BOARD_INITPINS_SDA_PERIPHERAL I2C0   /*!<@brief Device name: I2C0 */
#define BOARD_INITPINS_SDA_SIGNAL SDA        /*!<@brief I2C0 signal: SDA */
#define BOARD_INITPINS_SDA_PORT PORTE        /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_SDA_PIN 18U           /*!<@brief PORTE pin index: 18 */
#define BOARD_INITPINS_SDA_PIN_NAME I2C0_SDA /*!<@brief Pin name */
#define BOARD_INITPINS_SDA_LABEL "SDA"       /*!<@brief Label */
#define BOARD_INITPINS_SDA_NAME "SDA"        /*!<@brief Identifier name */
                                             /* @} */

/*! @name PORTE19 (number 6), SCL
  @{ */
#define BOARD_INITPINS_SCL_PERIPHERAL I2C0   /*!<@brief Device name: I2C0 */
#define BOARD_INITPINS_SCL_SIGNAL SCL        /*!<@brief I2C0 signal: SCL */
#define BOARD_INITPINS_SCL_PORT PORTE        /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_SCL_PIN 19U           /*!<@brief PORTE pin index: 19 */
#define BOARD_INITPINS_SCL_PIN_NAME I2C0_SCL /*!<@brief Pin name */
#define BOARD_INITPINS_SCL_LABEL "SCL"       /*!<@brief Label */
#define BOARD_INITPINS_SCL_NAME "SCL"        /*!<@brief Identifier name */
                                             /* @} */

/*! @name PORTA0 (number 12), SWD_CLK
  @{ */
#define BOARD_INITPINS_SWD_CLK_PERIPHERAL SWD   /*!<@brief Device name: SWD */
#define BOARD_INITPINS_SWD_CLK_SIGNAL CLK       /*!<@brief SWD signal: CLK */
#define BOARD_INITPINS_SWD_CLK_PORT PORTA       /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_SWD_CLK_PIN 0U           /*!<@brief PORTA pin index: 0 */
#define BOARD_INITPINS_SWD_CLK_PIN_NAME SWD_CLK /*!<@brief Pin name */
#define BOARD_INITPINS_SWD_CLK_LABEL "SWD_CLK"  /*!<@brief Label */
#define BOARD_INITPINS_SWD_CLK_NAME "SWD_CLK"   /*!<@brief Identifier name */
                                                /* @} */

/*! @name PORTA3 (number 15), SWD_DIO
  @{ */
#define BOARD_INITPINS_SWD_DIO_PERIPHERAL SWD   /*!<@brief Device name: SWD */
#define BOARD_INITPINS_SWD_DIO_SIGNAL DIO       /*!<@brief SWD signal: DIO */
#define BOARD_INITPINS_SWD_DIO_PORT PORTA       /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_SWD_DIO_PIN 3U           /*!<@brief PORTA pin index: 3 */
#define BOARD_INITPINS_SWD_DIO_PIN_NAME SWD_DIO /*!<@brief Pin name */
#define BOARD_INITPINS_SWD_DIO_LABEL "SWD_DIO"  /*!<@brief Label */
#define BOARD_INITPINS_SWD_DIO_NAME "SWD_DIO"   /*!<@brief Identifier name */
                                                /* @} */

/*! @name PORTA4 (number 16), OPEN
  @{ */
#define BOARD_INITPINS_OPEN_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_OPEN_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_OPEN_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_OPEN_GPIO_PIN 4U                        /*!<@brief PORTA pin index: 4 */
#define BOARD_INITPINS_OPEN_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_OPEN_PIN 4U                             /*!<@brief PORTA pin index: 4 */
#define BOARD_INITPINS_OPEN_CHANNEL 4                          /*!<@brief GPIOA GPIO channel: 4 */
#define BOARD_INITPINS_OPEN_PIN_NAME PTA4                      /*!<@brief Pin name */
#define BOARD_INITPINS_OPEN_LABEL "OPEN"                       /*!<@brief Label */
#define BOARD_INITPINS_OPEN_NAME "OPEN"                        /*!<@brief Identifier name */
#define BOARD_INITPINS_OPEN_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                               /* @} */

