RevolutionLighting/RPDG_Hardware/SRC/SmartStrip/board/pin_mux.h
/*! @name PORTA18 (number 17), EXTAL
  @{ */
#define BOARD_INITPINS_EXTAL_PERIPHERAL OSC0 /*!<@brief Device name: OSC0 */
#define BOARD_INITPINS_EXTAL_SIGNAL EXTAL0   /*!<@brief OSC0 signal: EXTAL0 */
#define BOARD_INITPINS_EXTAL_PORT PORTA      /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_EXTAL_PIN 18U         /*!<@brief PORTA pin index: 18 */
#define BOARD_INITPINS_EXTAL_PIN_NAME EXTAL0 /*!<@brief Pin name */
#define BOARD_INITPINS_EXTAL_LABEL "EXTAL"   /*!<@brief Label */
#define BOARD_INITPINS_EXTAL_NAME "EXTAL"    /*!<@brief Identifier name */
                                             /* @} */

/*! @name PORTA19 (number 18), XTAL
  @{ */
#define BOARD_INITPINS_XTAL_PERIPHERAL OSC0 /*!<@brief Device name: OSC0 */
#define BOARD_INITPINS_XTAL_SIGNAL XTAL0    /*!<@brief OSC0 signal: XTAL0 */
#define BOARD_INITPINS_XTAL_PORT PORTA      /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_XTAL_PIN 19U         /*!<@brief PORTA pin index: 19 */
#define BOARD_INITPINS_XTAL_PIN_NAME XTAL0  /*!<@brief Pin name */
#define BOARD_INITPINS_XTAL_LABEL "XTAL"    /*!<@brief Label */
#define BOARD_INITPINS_XTAL_NAME "XTAL"     /*!<@brief Identifier name */
                                            /* @} */

/*! @name PORTA20 (number 19), RESET
  @{ */
#define BOARD_INITPINS_RESET_PERIPHERAL LLWU  /*!<@brief Device name: LLWU */
#define BOARD_INITPINS_RESET_SIGNAL RESET     /*!<@brief LLWU signal: RESET */
#define BOARD_INITPINS_RESET_PORT PORTA       /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_RESET_PIN 20U          /*!<@brief PORTA pin index: 20 */
#define BOARD_INITPINS_RESET_PIN_NAME RESET_b /*!<@brief Pin name */
#define BOARD_INITPINS_RESET_LABEL "RESET"    /*!<@brief Label */
#define BOARD_INITPINS_RESET_NAME "RESET"     /*!<@brief Identifier name */
                                              /* @} */

/*! @name PORTC2 (number 23), TP7
  @{ */
#define BOARD_INITPINS_TP7_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_TP7_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_TP7_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_TP7_GPIO_PIN 2U                        /*!<@brief PORTC pin index: 2 */
#define BOARD_INITPINS_TP7_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_TP7_PIN 2U                             /*!<@brief PORTC pin index: 2 */
#define BOARD_INITPINS_TP7_CHANNEL 2                          /*!<@brief GPIOC GPIO channel: 2 */
#define BOARD_INITPINS_TP7_PIN_NAME PTC2                      /*!<@brief Pin name */
#define BOARD_INITPINS_TP7_LABEL "TP7"                        /*!<@brief Label */
#define BOARD_INITPINS_TP7_NAME "TP7"                         /*!<@brief Identifier name */
#define BOARD_INITPINS_TP7_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTC4 (number 25), TP6
  @{ */
#define BOARD_INITPINS_TP6_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_TP6_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_TP6_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_TP6_GPIO_PIN 4U                        /*!<@brief PORTC pin index: 4 */
#define BOARD_INITPINS_TP6_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_TP6_PIN 4U                             /*!<@brief PORTC pin index: 4 */
#define BOARD_INITPINS_TP6_CHANNEL 4                          /*!<@brief GPIOC GPIO channel: 4 */
#define BOARD_INITPINS_TP6_PIN_NAME PTC4                      /*!<@brief Pin name */
#define BOARD_INITPINS_TP6_LABEL "TP6"                        /*!<@brief Label */
#define BOARD_INITPINS_TP6_NAME "TP6"                         /*!<@brief Identifier name */
#define BOARD_INITPINS_TP6_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTC5 (number 26), TP5
  @{ */
#define BOARD_INITPINS_TP5_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_TP5_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_TP5_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_TP5_GPIO_PIN 5U                        /*!<@brief PORTC pin index: 5 */
#define BOARD_INITPINS_TP5_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_TP5_PIN 5U                             /*!<@brief PORTC pin index: 5 */
#define BOARD_INITPINS_TP5_CHANNEL 5                          /*!<@brief GPIOC GPIO channel: 5 */
#define BOARD_INITPINS_TP5_PIN_NAME PTC5                      /*!<@brief Pin name */
#define BOARD_INITPINS_TP5_LABEL "TP5"                        /*!<@brief Label */
#define BOARD_INITPINS_TP5_NAME "TP5"                         /*!<@brief Identifier name */
#define BOARD_INITPINS_TP5_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTC6 (number 27), UART_RX
  @{ */
#define BOARD_INITPINS_UART_RX_PERIPHERAL UART0  /*!<@brief Device name: UART0 */
#define BOARD_INITPINS_UART_RX_SIGNAL RX         /*!<@brief UART0 signal: RX */
#define BOARD_INITPINS_UART_RX_PORT PORTC        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_UART_RX_PIN 6U            /*!<@brief PORTC pin index: 6 */
#define BOARD_INITPINS_UART_RX_PIN_NAME UART0_RX /*!<@brief Pin name */
#define BOARD_INITPINS_UART_RX_LABEL "UART_RX"   /*!<@brief Label */
#define BOARD_INITPINS_UART_RX_NAME "UART_RX"    /*!<@brief Identifier name */
                                                 /* @} */

/*! @name PORTC7 (number 28), UART_TX
  @{ */
#define BOARD_INITPINS_UART_TX_PERIPHERAL UART0                   /*!<@brief Device name: UART0 */
#define BOARD_INITPINS_UART_TX_SIGNAL TX                          /*!<@brief UART0 signal: TX */
#define BOARD_INITPINS_UART_TX_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_UART_TX_PIN 7U                             /*!<@brief PORTC pin index: 7 */
#define BOARD_INITPINS_UART_TX_PIN_NAME UART0_TX                  /*!<@brief Pin name */
#define BOARD_INITPINS_UART_TX_LABEL "UART_TX"                    /*!<@brief Label */
#define BOARD_INITPINS_UART_TX_NAME "UART_TX"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_UART_TX_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTE30 (number 9), CH1_DIM
  @{ */
#define BOARD_INITPINS_CH1_DIM_PERIPHERAL FTM0                    /*!<@brief Device name: FTM0 */
#define BOARD_INITPINS_CH1_DIM_SIGNAL CH                          /*!<@brief FTM0 signal: CH */
#define BOARD_INITPINS_CH1_DIM_PORT PORTE                         /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_CH1_DIM_PIN 30U                            /*!<@brief PORTE pin index: 30 */
#define BOARD_INITPINS_CH1_DIM_CHANNEL 3                          /*!<@brief FTM0 channel: 3 */
#define BOARD_INITPINS_CH1_DIM_PIN_NAME FTM0_CH3                  /*!<@brief Pin name */
#define BOARD_INITPINS_CH1_DIM_LABEL "CH1_DIM"                    /*!<@brief Label */
#define BOARD_INITPINS_CH1_DIM_NAME "CH1_DIM"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_CH1_DIM_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTE24 (number 10), CH2_DIM
  @{ */
#define BOARD_INITPINS_CH2_DIM_PERIPHERAL FTM0                    /*!<@brief Device name: FTM0 */
#define BOARD_INITPINS_CH2_DIM_SIGNAL CH                          /*!<@brief FTM0 signal: CH */
#define BOARD_INITPINS_CH2_DIM_PORT PORTE                         /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_CH2_DIM_PIN 24U                            /*!<@brief PORTE pin index: 24 */
#define BOARD_INITPINS_CH2_DIM_CHANNEL 0                          /*!<@brief FTM0 channel: 0 */
#define BOARD_INITPINS_CH2_DIM_PIN_NAME FTM0_CH0                  /*!<@brief Pin name */
#define BOARD_INITPINS_CH2_DIM_LABEL "CH2_DIM"                    /*!<@brief Label */
#define BOARD_INITPINS_CH2_DIM_NAME "CH2_DIM"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_CH2_DIM_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTE25 (number 11), CH3_DIM
  @{ */
#define BOARD_INITPINS_CH3_DIM_PERIPHERAL FTM0                    /*!<@brief Device name: FTM0 */
#define BOARD_INITPINS_CH3_DIM_SIGNAL CH                          /*!<@brief FTM0 signal: CH */
#define BOARD_INITPINS_CH3_DIM_PORT PORTE                         /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_CH3_DIM_PIN 25U                            /*!<@brief PORTE pin index: 25 */
#define BOARD_INITPINS_CH3_DIM_CHANNEL 1                          /*!<@brief FTM0 channel: 1 */
#define BOARD_INITPINS_CH3_DIM_PIN_NAME FTM0_CH1                  /*!<@brief Pin name */
#define BOARD_INITPINS_CH3_DIM_LABEL "CH3_DIM"                    /*!<@brief Label */
#define BOARD_INITPINS_CH3_DIM_NAME "CH3_DIM"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_CH3_DIM_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTB0 (number 20), CH6_DIM
  @{ */
#define BOARD_INITPINS_CH6_DIM_PERIPHERAL FTM1                    /*!<@brief Device name: FTM1 */
#define BOARD_INITPINS_CH6_DIM_SIGNAL CH                          /*!<@brief FTM1 signal: CH */
#define BOARD_INITPINS_CH6_DIM_PORT PORTB                         /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_CH6_DIM_PIN 0U                             /*!<@brief PORTB pin index: 0 */
#define BOARD_INITPINS_CH6_DIM_CHANNEL 0                          /*!<@brief FTM1 channel: 0 */
#define BOARD_INITPINS_CH6_DIM_PIN_NAME FTM1_CH0                  /*!<@brief Pin name */
#define BOARD_INITPINS_CH6_DIM_LABEL "CH6_DIM"                    /*!<@brief Label */
#define BOARD_INITPINS_CH6_DIM_NAME "CH6_DIM"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_CH6_DIM_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

