RevolutionLighting/RPDG_Hardware/SRC/SmartStrip/board/pin_mux.h
/*! @name PORTA2 (number 14), CH5_DIM
  @{ */
#define BOARD_INITPINS_CH5_DIM_PERIPHERAL FTM2                    /*!<@brief Device name: FTM2 */
#define BOARD_INITPINS_CH5_DIM_SIGNAL CH                          /*!<@brief FTM2 signal: CH */
#define BOARD_INITPINS_CH5_DIM_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_CH5_DIM_PIN 2U                             /*!<@brief PORTA pin index: 2 */
#define BOARD_INITPINS_CH5_DIM_CHANNEL 1                          /*!<@brief FTM2 channel: 1 */
#define BOARD_INITPINS_CH5_DIM_PIN_NAME FTM2_CH1                  /*!<@brief Pin name */
#define BOARD_INITPINS_CH5_DIM_LABEL "CH5_DIM"                    /*!<@brief Label */
#define BOARD_INITPINS_CH5_DIM_NAME "CH5_DIM"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_CH5_DIM_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTB1 (number 21), CH7_DIM
  @{ */
#define BOARD_INITPINS_CH7_DIM_PERIPHERAL FTM1                    /*!<@brief Device name: FTM1 */
#define BOARD_INITPINS_CH7_DIM_SIGNAL CH                          /*!<@brief FTM1 signal: CH */
#define BOARD_INITPINS_CH7_DIM_PORT PORTB                         /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_CH7_DIM_PIN 1U                             /*!<@brief PORTB pin index: 1 */
#define BOARD_INITPINS_CH7_DIM_CHANNEL 1                          /*!<@brief FTM1 channel: 1 */
#define BOARD_INITPINS_CH7_DIM_PIN_NAME FTM1_CH1                  /*!<@brief Pin name */
#define BOARD_INITPINS_CH7_DIM_LABEL "CH7_DIM"                    /*!<@brief Label */
#define BOARD_INITPINS_CH7_DIM_NAME "CH7_DIM"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_CH7_DIM_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTC1 (number 22), TP9
  @{ */
#define BOARD_INITPINS_TP9_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_TP9_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_TP9_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_TP9_GPIO_PIN 1U                        /*!<@brief PORTC pin index: 1 */
#define BOARD_INITPINS_TP9_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_TP9_PIN 1U                             /*!<@brief PORTC pin index: 1 */
#define BOARD_INITPINS_TP9_CHANNEL 1                          /*!<@brief GPIOC GPIO channel: 1 */
#define BOARD_INITPINS_TP9_PIN_NAME PTC1                      /*!<@brief Pin name */
#define BOARD_INITPINS_TP9_LABEL "TP9"                        /*!<@brief Label */
#define BOARD_INITPINS_TP9_NAME "TP9"                         /*!<@brief Identifier name */
#define BOARD_INITPINS_TP9_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTC3 (number 24), CH8_DIM
  @{ */
#define BOARD_INITPINS_CH8_DIM_PERIPHERAL FTM0                    /*!<@brief Device name: FTM0 */
#define BOARD_INITPINS_CH8_DIM_SIGNAL CH                          /*!<@brief FTM0 signal: CH */
#define BOARD_INITPINS_CH8_DIM_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_CH8_DIM_PIN 3U                             /*!<@brief PORTC pin index: 3 */
#define BOARD_INITPINS_CH8_DIM_CHANNEL 2                          /*!<@brief FTM0 channel: 2 */
#define BOARD_INITPINS_CH8_DIM_PIN_NAME FTM0_CH2                  /*!<@brief Pin name */
#define BOARD_INITPINS_CH8_DIM_LABEL "CH8_DIM"                    /*!<@brief Label */
#define BOARD_INITPINS_CH8_DIM_NAME "CH8_DIM"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_CH8_DIM_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTD4 (number 29), CH9_DIM
  @{ */
#define BOARD_INITPINS_CH9_DIM_PERIPHERAL FTM0                    /*!<@brief Device name: FTM0 */
#define BOARD_INITPINS_CH9_DIM_SIGNAL CH                          /*!<@brief FTM0 signal: CH */
#define BOARD_INITPINS_CH9_DIM_PORT PORTD                         /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_CH9_DIM_PIN 4U                             /*!<@brief PORTD pin index: 4 */
#define BOARD_INITPINS_CH9_DIM_CHANNEL 4                          /*!<@brief FTM0 channel: 4 */
#define BOARD_INITPINS_CH9_DIM_PIN_NAME FTM0_CH4                  /*!<@brief Pin name */
#define BOARD_INITPINS_CH9_DIM_LABEL "CH9_DIM"                    /*!<@brief Label */
#define BOARD_INITPINS_CH9_DIM_NAME "CH9_DIM"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_CH9_DIM_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTD5 (number 30), CH10_DIM
  @{ */
#define BOARD_INITPINS_CH10_DIM_PERIPHERAL FTM0                    /*!<@brief Device name: FTM0 */
#define BOARD_INITPINS_CH10_DIM_SIGNAL CH                          /*!<@brief FTM0 signal: CH */
#define BOARD_INITPINS_CH10_DIM_PORT PORTD                         /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_CH10_DIM_PIN 5U                             /*!<@brief PORTD pin index: 5 */
#define BOARD_INITPINS_CH10_DIM_CHANNEL 5                          /*!<@brief FTM0 channel: 5 */
#define BOARD_INITPINS_CH10_DIM_PIN_NAME FTM0_CH5                  /*!<@brief Pin name */
#define BOARD_INITPINS_CH10_DIM_LABEL "CH10_DIM"                   /*!<@brief Label */
#define BOARD_INITPINS_CH10_DIM_NAME "CH10_DIM"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_CH10_DIM_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                   /* @} */

/*! @name PORTD6 (number 31), CH11_DIM
  @{ */
#define BOARD_INITPINS_CH11_DIM_PERIPHERAL FTM4                    /*!<@brief Device name: FTM4 */
#define BOARD_INITPINS_CH11_DIM_SIGNAL CH                          /*!<@brief FTM4 signal: CH */
#define BOARD_INITPINS_CH11_DIM_PORT PORTD                         /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_CH11_DIM_PIN 6U                             /*!<@brief PORTD pin index: 6 */
#define BOARD_INITPINS_CH11_DIM_CHANNEL 0                          /*!<@brief FTM4 channel: 0 */
#define BOARD_INITPINS_CH11_DIM_PIN_NAME FTM4_CH0                  /*!<@brief Pin name */
#define BOARD_INITPINS_CH11_DIM_LABEL "CH11_DIM"                   /*!<@brief Label */
#define BOARD_INITPINS_CH11_DIM_NAME "CH11_DIM"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_CH11_DIM_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                   /* @} */

/*! @name PORTA1 (number 13), CH4_DIM
  @{ */
#define BOARD_INITPINS_CH4_DIM_PERIPHERAL FTM2                    /*!<@brief Device name: FTM2 */
#define BOARD_INITPINS_CH4_DIM_SIGNAL CH                          /*!<@brief FTM2 signal: CH */
#define BOARD_INITPINS_CH4_DIM_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_CH4_DIM_PIN 1U                             /*!<@brief PORTA pin index: 1 */
#define BOARD_INITPINS_CH4_DIM_CHANNEL 0                          /*!<@brief FTM2 channel: 0 */
#define BOARD_INITPINS_CH4_DIM_PIN_NAME FTM2_CH0                  /*!<@brief Pin name */
#define BOARD_INITPINS_CH4_DIM_LABEL "CH4_DIM"                    /*!<@brief Label */
#define BOARD_INITPINS_CH4_DIM_NAME "CH4_DIM"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_CH4_DIM_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTD7 (number 32), CH12_DIM
  @{ */
#define BOARD_INITPINS_CH12_DIM_PERIPHERAL FTM4                    /*!<@brief Device name: FTM4 */
#define BOARD_INITPINS_CH12_DIM_SIGNAL CH                          /*!<@brief FTM4 signal: CH */
#define BOARD_INITPINS_CH12_DIM_PORT PORTD                         /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_CH12_DIM_PIN 7U                             /*!<@brief PORTD pin index: 7 */
#define BOARD_INITPINS_CH12_DIM_CHANNEL 1                          /*!<@brief FTM4 channel: 1 */
#define BOARD_INITPINS_CH12_DIM_PIN_NAME FTM4_CH1                  /*!<@brief Pin name */
#define BOARD_INITPINS_CH12_DIM_LABEL "CH12_DIM"                   /*!<@brief Label */
#define BOARD_INITPINS_CH12_DIM_NAME "CH12_DIM"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_CH12_DIM_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
